{
    "664116": {
        "article_title": "Made at Intel. Architecture and religion — v2",
        "article_sub_title": "Процессоры",
        "article_author": "vvvphoenix",
        "article_date": "2022-05-03, 14:52:41",
        "article_desc": "Это -продолжение (но еще не окончание!) первой главы. Начало –здесь.Linpack – как важнейшее из искусствВторой важнейший “культ”, который определял развитие серверной архитектуры на протяжении десятилетий – это “сакрализация” Linpack. Сам бенчмарк представлен Джеком Донгаррой аж в 1979 году. Но  культовым статусом своим он обязан усилиями маркетологов из многих IT компаний (Intel, AMD, IBM, Nvidia, Fujitsu и тд). Linpack имеет массу неоспоримых достоинств.•  Это всего лишь ОДИН тест, в отличие от скажем SPEC CPU, где их 40 с хвостиком.•  К тому же (в отличие от SPEC) он совершенно бесплатный.•  Очень легко обьяснить, что Linpack делает. Он решает систему линейных алгебраических уравнений с числами двойной точности. Используется метод (P)LU разложения (Гаусса) с выбором ведущего элемента.• В качестве результата Linpack выдает ОДНО число – измеренную производительность системы  в (гига -, тера -, пета -, экза) флопах. На основании Linpack строится мировой рейтинг суперкомпьютеров  TOP500 и российский TOP50.  Так же вычисляют эффективность (искушенные люди обращают на нее внимание), как отношение измеренной производительности к пиковой. Правда, в последнее время само понятие эффективности является несколько “размытым”, из-за того что в процессе исполнения теста тактовая частота может “плавать”.• Linpack идеально параллелится (MPI, OpenMP и вообще что угодно) и векторизуется.• И наконец Linpack обеспечивает практически полную (>90%) загрузку вычислительных устройств. В то время как обычные приложения редко показвают больше 20.",
        "article_url": "https://habr.com/ru/post/664116/"
    },
    "664110": {
        "article_title": "Где в смартфоне навигационный чип? Часть 1",
        "article_sub_title": "Глобальные системы позиционирования *",
        "article_author": "Korogodin",
        "article_date": "2022-05-03, 13:44:31",
        "article_desc": "Если спросить разработчика-железячника чем ему нравится его работа, многие ответят, что возможностью пощупать результат своего труда. Это приятное чувство, когда плата в руках. Она точно такая, как ты её представлял, как ты её придумал. Моргает светодиодами, впивается в руку острой гранью, оставляет след. Это не \"бездушный софт\", который не покажешь ребенку и не положишь под стекло на выставке. Но у меня есть ощущение, что эта радость постепенно уходит в прошлое. Покажу на примере приемников спутниковых навигационных систем. Что такое ГНСС приемник? С системной точки зрения, это один из трех компонентов системы в одном ряду с сегментом космических аппаратов и сегментом контроля и управления.",
        "article_url": "https://habr.com/ru/post/664110/"
    },
    "664082": {
        "article_title": "Дайджест недели от Apple Pro Weekly News (25.04 – 1.05.22)",
        "article_sub_title": "Гаджеты",
        "article_author": "aaplpro",
        "article_date": "2022-05-03, 13:13:01",
        "article_desc": "Запуск магазина для самостоятельного ремонта, новые слухи про iPhone 14, свежие бета-версии операционных систем, квартальный отчёт Apple и планы по удалению приложений не получающих обновления – это и многое другое в новом дайджесте событий из мира Apple, нам есть что рассказать!",
        "article_url": "https://habr.com/ru/post/664082/"
    },
    "664108": {
        "article_title": "Психология в дизайне: как превратить пользователей в покупателей",
        "article_sub_title": "Интерфейсы *",
        "article_author": "Ellie_Soley",
        "article_date": "2022-05-03, 13:08:59",
        "article_desc": "Психология в дизайне — очень сильный инструмент. Знание типичных паттернов мышления позволяет упростить взаимодействие пользователя с интерфейсом вашего сервиса, увеличить конверсии в продажу на сайте. Очевидно, что тема взаимодействия психологии и дизайна приобретает особое значение для онлайн-магазинов. Эта публикация — мой авторский перевод-резюме англоязычной статьи из блога shopify.В статье приводится краткое описание лайфхаков для улучшения опыта пользователей интернет-магазинов от экспертов в сфере UX-проектирования, копирайтинга, создания контента, маркетинга и разработки. 1.     Помните об этике«Когда люди начинают пользоваться психологией, чтобы превратить пользователей в клиентов, они могут скоро оказаться в мире манипуляций» — напоминает консультант по пользовательскому опыту Пол Боаг. «Хотя психологические уловки типа тёмных паттернов работают, они в конечном итоге отдаляют от нас пользователей. Это приводит к сожалению о сделанной покупке и плохим отзывам.»Возьмём пример сайта booking и expedia, применяющих эффект дефицита. Вспомним их пресловутый мини-баннер «остался только один номер по этой цене». Сайт показывает сколько людей просматривает сейчас страницу с описанием понравившегося вам номера, как долго номер будет доступен по указанной цене — все эти детали могут создать ложное впечатление ограниченной доступности номеров, подталкивая пользователя совершить покупку. Такая практика подверглась критике со стороны британского управления по защите конкуренции и рынкам.",
        "article_url": "https://habr.com/ru/post/664108/"
    },
    "664102": {
        "article_title": "Как избежать «подводных камней» машинного обучения: руководство для академических исследователей",
        "article_sub_title": "Машинное обучение *",
        "article_author": "novoselov_am",
        "article_date": "2022-05-03, 12:45:51",
        "article_desc": "Этот лонг-рид является сильно переработанным и расширенным переводом статьи How to avoid machine learning pitfalls: a guide for academic researchers (Lones, 2021). Статья является кратким описанием ряда распространенных ошибок, возникающих при использовании методов машинного обучения, и руководством к тому, как их избежать. Материал предназначен в первую очередь для студентов-исследователей и касается вопросов, регулярно возникающих в академических исследованиях, например, необходимости проводить строгие сравнения и делать обоснованные выводы. Однако материал применим к использованию ML и в других областях.",
        "article_url": "https://habr.com/ru/post/664102/"
    },
    "664098": {
        "article_title": "Маленький баг в тестировании на Laravel",
        "article_sub_title": "Laravel *",
        "article_author": "MaryRabinovich",
        "article_date": "2022-05-03, 12:24:36",
        "article_desc": "Статья будет небольшая, даже совсем короткая. Для фанатов TDD, верящих, что фреймворки делают в небесах.Пару часов ковырялась с тестом $response->assertJson()->assertJsonMissing(); при одинаковом содержании обеих скобок:",
        "article_url": "https://habr.com/ru/post/664098/"
    },
    "664086": {
        "article_title": "Основная информация про опен сорс и полезные ссылки",
        "article_sub_title": "Open source *",
        "article_author": "PoponinaEkaterina",
        "article_date": "2022-05-03, 09:35:19",
        "article_desc": "Написано довольно много хороших материалов о свободных лицензиях, в том числе тут, на habr. Почему стоит прочитать еще и эту статью:",
        "article_url": "https://habr.com/ru/post/664086/"
    },
    "663680": {
        "article_title": "Цифровая линия задержки аудиосигнала PT2399",
        "article_sub_title": "Блог компании RUVDS.com",
        "article_author": "Lunathecat",
        "article_date": "Date 2022-05-03, Time 09:00:02",
        "article_desc": "No description",
        "article_url": "https://habr.com/ru/company/ruvds/blog/663680/"
    },
    "664058": {
        "article_title": "Осмысление задачи и составление плана на хакатон",
        "article_sub_title": "Хакатоны",
        "article_author": "sweetlhare",
        "article_date": "2022-05-03, 09:00:01",
        "article_desc": "Во втором выпуске цикла о том, как участвовать в хакатонах, поделюсь советами, которые касаются составления плана на хакатон и проработки задачи.После момента получения задачи нужно понять, что вообще с ней делать. Очевидный ответ - начать решать. Но, чтобы не потеряться в решении лучше всегда иметь план.Шаг 1 - Постараться придумать все возможные варианты решения задачи (даже те, которые реализовать не хватит сил). Перечень различных вариантов позволит выделить наиболее выгодные и сильные. А также даст понять, что можно сделать быстро и наверняка, а что потребует времени и может не дать нужных результатов.Шаг 2 - составление плана проработки перечня вариантов. Необходимо расположить варианты решения от тех, которые точно получится сделать, к рискованным. Хотя, если вы человек азартный, то можете и рискнуть. Данный план поможет не сбиться с пути и полностью проконтролировать ход работ.На этих шагах лично мне помогают следующие инструменты: Trello (https://trello.com) - если любите планеры, Miro (https://miro.com) - если блок-схемы или обычные заметки - если нужно побыстрее.Шаг 3 - следование плану. В процессе проработки решения обязательно отмечайте выполненные пункты и расписывайте, что получилось, а что нет (что дало прирост метрики, а что нет). Получится этакий контроль версий, только в плане идей для решения. Помимо прочего данные заметки помогут собрать решение воедино, объединив самые удачные наработки.Мне эти действия не раз помогали на хакатонах, надеюсь, помогут и вам!",
        "article_url": "https://habr.com/ru/post/664058/"
    },
    "663996": {
        "article_title": "Водородные электромобили",
        "article_sub_title": "Блог компании ua-hosting.company",
        "article_author": "Irina_klein",
        "article_date": "Date 2022-05-03, Time 08:42:33",
        "article_desc": "No description",
        "article_url": "https://habr.com/ru/company/ua-hosting/blog/663996/"
    },
    "663752": {
        "article_title": "Dell VRTX — четыре блейда у вас под столом",
        "article_sub_title": "Блог компании Сервер Молл",
        "article_author": "Barseadar",
        "article_date": "2022-05-03, 08:30:01",
        "article_desc": "Давайте начистоту, мировой рынок серверов устоялся. На нём закрепились мастодонты, вроде Dell, HPE, Lenovo, IBM, Cisco, Huawei и другие. Все производят плюс-минус схожие линейки серверов: башенные, стоечные, блейд-системы. Принципиально новых решений почти не появляется. Вышли на плато и скучную эволюционная модель развития. Но есть кое что интересное, выбивающееся из серого однообразия — Dell PowerEdge VRTX. Модель не новая, но если стряхнуть пыль, то она сможет вас удивить.",
        "article_url": "https://habr.com/ru/company/servermall/blog/663752/"
    },
    "664076": {
        "article_title": "Развертывание моделей машинного обучения. Часть первая. Размещаем Web-приложение в облачной платформе Heroku",
        "article_sub_title": "Облачные вычисления *",
        "article_author": "asozykin",
        "article_date": "2022-05-03, 08:19:37",
        "article_desc": "В этой серии статей мы рассмотрим, как на основе готовых моделей создавать приложения, использующие машинное обучение, и организовывать доступ пользователей к ним. Начнем с создания Web-приложения для классификации изображений на Streamlit и развертывания его на облачной платформе Heroku в бесплатном аккаунте.",
        "article_url": "https://habr.com/ru/post/664076/"
    },
    "664056": {
        "article_title": "Как находить и выбирать хакатоны? Где искать команду?",
        "article_sub_title": "Хакатоны",
        "article_author": "sweetlhare",
        "article_date": "2022-05-03, 07:00:02",
        "article_desc": "Прежде, чем приступать к решению хакатона, нужно его найти, грамотно выбрать задачу и собрать команду. Именно об этом я и расскажу.",
        "article_url": "https://habr.com/ru/post/664056/"
    },
    "664062": {
        "article_title": "Рефакторинг жизни. Почему тестирование — больше, чем просто работа",
        "article_sub_title": "Тестирование IT-систем *",
        "article_author": "artemedani",
        "article_date": "2022-05-03, 06:31:43",
        "article_desc": "Я бы хотел поделиться с тобой личной историей.Всего пять лет назад, я находился в состоянии глубокого внутреннего кризиса.Я не знал, что мне делать.2017 год, мне 27, я принял решение что-то в жизни поменять, но не знал, как.Мне нужен был план. Пути назад не было, да и вперед тоже.Прошлая жизнь, работы, дела, люди — всё осталось позади.Мне нужны были перемены.Мне нужна была цель.Я смотрел в окно съемной квартиры в чужом городе и пытался понять,зачем я здесь.Окей, мне хочется пожить в другой стране — это раз. Меня всегда привлекали странствия.Хочу иметь интересную профессию, мне нравятся технологии — это два.Хочу приносить пользу, делать что-то особенное, быть ключевым человекомв своем деле.Это три.И жить в кайф.Получить какую-то рабочую или учебную визу сходу не получилось,гринку в очередной раз не выиграл, даже туристическую визу не дали.Чего-то не хватало, было ощущение, что я упускаю какой-то важный этап — мне нужен был фундамент здесь и сейчас, перепрыгнуть не удавалось, стартовать необходимо было из текущей позиции.Про QA я знал только, что вновь приехавшие в штаты жить, люди, осваивали эту специальность, успешно адаптировались в новой стране и были безумно довольны своей работой.Что же, почему я не могу сделать тоже самое, только сначала здесь?А потом, когда мне откроется новый мир технологий, полезностии востребованности, все пути будут открыты.Я открыл сайт с вакансиями — весной 2017 года в Казани, где я находился,было около 20 вакансий на позицию QA Engineer, опыт требовался от трех лет.",
        "article_url": "https://habr.com/ru/post/664062/"
    },
    "661581": {
        "article_title": "5 самых интересных DIY-проектов на Rasberry Pi начала мая: праздники не проходят даром",
        "article_sub_title": "Блог компании Selectel",
        "article_author": "Ccelebro",
        "article_date": "Date 2022-05-03, Time 01:04:53",
        "article_desc": "No description",
        "article_url": "https://habr.com/ru/company/selectel/blog/661581/"
    },
    "664054": {
        "article_title": "Почему программистам нужно знать структуры данных и как я сэкономил Uber $22 000 в год",
        "article_sub_title": "Чулан",
        "article_author": "darhonbek",
        "article_date": "2022-05-03, 00:53:13",
        "article_desc": "Как я оптимизировал аналитику используя структуры данных. Что в итоге сэкономило $22 000",
        "article_url": "https://habr.com/ru/post/664054/"
    },
    "664038": {
        "article_title": "Почему не работают стримеры, и как раскрутить свою игру?",
        "article_sub_title": "Медийная реклама",
        "article_author": "EatingPeopleIsFun",
        "article_date": "2022-05-02, 19:49:26",
        "article_desc": "Доброго времени суток! В этой статье, хочу рассказать о нашем проекте, подсветить проблемы и подискутировать на волнующие темы со знающими хабровчанами. Прошу не расценивать как Гайд по раскрутке, скорее наоборот.Что у меня за волнующие темы? Да собственно одна есть, самая важная, которая беспокоит всю команду - привлечение игроков. Для игры нашего жанра (MMO RolePlay), количество игроков является неким парадоксом. Чем больше игроков, тем интереснее играть, тем быстрее растет онлайн. И обратная ситуация - мало игроков, играть не так интересно, онлайн падает. Получается: чтобы повысить онлайн, нужен интересный контент, а чтобы был интересный контент, нужно повысить онлайн :)Речь пойдет об игре GTA5 и о нашем проекте Divine RolePlay",
        "article_url": "https://habr.com/ru/post/664038/"
    },
    "664036": {
        "article_title": "Советы для начинающих (и не очень) разработчиков на Unreal Engine",
        "article_sub_title": "Разработка игр *",
        "article_author": "tzay",
        "article_date": "2022-05-02, 19:47:45",
        "article_desc": "В этой статье я стараюсь поверхностно пройтись по, как как мне кажется, наиболее важным для новичков аспектам разработки на Unreal Engine. Моя цель - подсказать вам направления, в которых можно и нужно копнуть поглубже. Рассказать что есть и для чего это можно использовать, как решать некоторые типовые проблемы. Почти для всех топиков я привожу ссылки на более конкретные гайды и описательные статьи. Они могут вам помочь.Надеюсь что описанные мною вещи будут вам интересны и полезны. Желаю приятного чтения :-)",
        "article_url": "https://habr.com/ru/post/664036/"
    },
    "664034": {
        "article_title": "Большая статья о переезде на остров Пенанг, Малайзия. Часть 3",
        "article_sub_title": "IT-эмиграция",
        "article_author": "samson28",
        "article_date": "2022-05-02, 19:23:54",
        "article_desc": "Работа, климат, магазиныВ предыдущих статьях я написал о получении работы в Малайзии и о жизни в Малайзии. Здесь я постараюсь больше написать о работе, рабочем окружении, расскажу о покупках и налогах.",
        "article_url": "https://habr.com/ru/post/664034/"
    },
    "664030": {
        "article_title": "Новости Yii 2022, выпуск 1",
        "article_sub_title": "PHP *",
        "article_author": "SamDark",
        "article_date": "2022-05-02, 17:48:27",
        "article_desc": "Всем привет!Мы думали, что 2021 был тяжёлым годом из-за COVID. Текущий 2022 очень неприятно удивил.Начался он с потери важного члена сообщества и отличного человека, Юлии \"Insolita\". Продолжился тем, что Россия начала полновесную военную операцию в Украине.Что же мы имеем на данный момент?",
        "article_url": "https://habr.com/ru/post/664030/"
    }
}