{
    "5003130": {
        "job_href": "https://www.fl.ru/projects/5003130/kalkulyator-rascheta-produktsii-dlya-sayta-na-bitrix.html",
        "job_title": "Калькулятор расчета продукции для сайта на bitrix",
        "job_description": "Добрый день. Для сайта на битрикс нужно создать калькулятор, для расчета стоимости печатной продукции для клиента.  Пример калькулятора enjoyprint.ru/pechat-vizi...  (в нижней части страницы). Для каждой категории продукции, нужны будут свои данные для расчета.  Присылайте пожалуйста сразу примерную стоимость реализации (или вилку)"
    },
    "5003129": {
        "job_href": "https://www.fl.ru/projects/5003129/nastroyka-ssl-sertifikatov-na-cloudflare.html",
        "job_title": "Настройка SSL сертификатов на CloudFlare",
        "job_description": "Продлить SSL сертификаты на CloudFlare. Нужна консультация."
    },
    "5003128": {
        "job_href": "https://www.fl.ru/projects/5003128/pochinit-rabotu-pochtovyih-form-na-sayte-.html",
        "job_title": "Починить работу почтовых форм на сайте. ",
        "job_description": "Необходимо разобраться в коде и настроить отправку 7-ми почтовых форм с сайта через SMTP Яндекс. Сайт Juicemaster.ru Ранее почта отправлялась через Google, но c 30 мая 2022 года Гугл закрыл доступ небезопасным приложениям (в том числе отправке почты через обычный SMTP).  Сайт на CMS Multicontent. Есть доступ на FTP и более ничего. Пожалуйста, Вашу цену, срок, примеры работ."
    },
    "5003122": {
        "job_href": "https://www.fl.ru/projects/5003122/napisat-telegram-bot-dlya-voditeley-yandekstaksi.html",
        "job_title": "Написать телеграм-бот для водителей яндекс.такси",
        "job_description": "Нужно написать телеграм-бот для водителей яндекс.такси. Интеграция с рабочим кабинетом парка в агрегаторе. 1. Задача – самостоятельная регистрация  водителя в парке 2. Задача – возможность просмотра своего профиля водителя, возможность самостоятельного изменения данных в профиле.  Пример бота в телеграме: @online_taxi_bot"
    },
    "5003117": {
        "job_href": "https://www.fl.ru/projects/5003117/prilojenie-v-google-play.html",
        "job_title": "Приложение в Google play",
        "job_description": "Вёрстка фронта и адаптивность Мультиязычность"
    },
    "5003115": {
        "job_href": "https://www.fl.ru/projects/5003115/prilojenie-dlya-win-na-yazyike-c-sharp.html",
        "job_title": "Приложение для win на языке C Sharp",
        "job_description": "Написать приложение для Win на языке C Sharp с графическим выводом. Данная программа есть на языке Delphi."
    },
    "5003110": {
        "job_href": "https://www.fl.ru/projects/5003110/nastroit-otchet-ucheta-zapasov-po-shablonu-.html",
        "job_title": "Настроить отчет учета запасов по шаблону. ",
        "job_description": "Необходимо в 1С:Медицина Стоматологическая клиника от Хеликса  Настроить отчет учета запасов по шаблону.  готовый шаблон есть. важен человек с опытом работы в  1С:Медицина Стоматологическая клиника от Хеликса так как в перспективе будут еще задачи."
    },
    "5003096": {
        "job_href": "https://www.fl.ru/projects/5003096/neobhodimo-podklyuchit-3d-modul-na-sayt.html",
        "job_title": "Необходимо подключить 3д модуль на сайт.",
        "job_description": "Что должно быть видно на визуализации 3д модели здания:  1. Возможность выбора этажа 2. Переход после выбора этажа на план всего этажа с планировками квартир  3. Возможность выбора квартире на плане  4. Переход по выбранной кв на общую информацию об квартире (метраж, этаж, стоимость и тд.)  5. Форма обратной связи с менеджером   Здесь можно посмотреть пример подобного подключения hill8.ru/apartments/visua... (необходимо ознакомиться с примером, так как нужно сделать примерно также, только без виртуальной прогулки по кв и вида на местность)   При отклике прошу прописывать сразу же стоимость работ и возможные сроки выполнения задачи!"
    },
    "5003111": {
        "job_href": "https://www.fl.ru/projects/5003111/sistema-kontrolya-obyazatelstv-po-predoplate.html",
        "job_title": "Система контроля обязательств по предоплате",
        "job_description": "Создать информационную систему для контроля обязательств по предоплате. Желательно по исполнению данной задачи предоставить схему данных."
    },
    "5003107": {
        "job_href": "https://www.fl.ru/projects/5003107/sdelat-bota-zapisi-.html",
        "job_title": "Сделать бота записи ",
        "job_description": "Нужно создать бота записи на подачу для визы visa.vfsglobal.com/rus/ru... В форме выбирается город подачи, вносятся данные заявителя по загранпаспорту. Бот ловит первое попавшееся время для записи."
    },
    "5003112": {
        "job_href": "https://www.fl.ru/projects/5003112/nastroit-i-zapustit-telegram-bot.html",
        "job_title": "Настроить и запустить телеграм бот",
        "job_description": "Нужно существующий скрипт телеграм бота, загрузить на сервер, запустить его и настроить работоспособность. Задача бота отправлять фото отзывов о товаре в телеграмм группу."
    },
    "5003083": {
        "job_href": "https://www.fl.ru/projects/5003083/v-google-tablitse-nastroit-kalendar-vyipolnennyih-rabot.html",
        "job_title": "В Google Таблице настроить календарь выполненных работ",
        "job_description": "В Гугл таблице нужно сделать автоматический календарь выполненных работ.  Есть список работ, и на календаре нужно поставить нужную букву в соответствии кто выполнял . Если в 1 день выполняли 2 сотрудника 1 работу то ставить 2 буквы"
    },
    "5003082": {
        "job_href": "https://www.fl.ru/projects/5003082/sozdanie-google-work-space.html",
        "job_title": "Создание Google Work Space",
        "job_description": "Всем привет! Для нашего нового направления бизнеса нужна помощь в создании эко-системы компании. Нужен специалист, который разбирается в сайтах, доменах, телефонии, почте, диске и поможет нам это все подключить и настроить. Все подробности в личку."
    },
    "5003079": {
        "job_href": "https://www.fl.ru/projects/5003079/skachat-ves-material-s-sayta-baza-znaniychtob-prosmatrivat-v-oflayn.html",
        "job_title": "Скачать весь материал с сайта (база знаний)чтоб просматривать в офлайн",
        "job_description": "Скачать сайт в офлайн режим чтоб просматривать офлайн!"
    },
    "5003080": {
        "job_href": "https://www.fl.ru/projects/5003080/chat-bot-dlya-vkontakte.html",
        "job_title": "Чат бот для вконтакте",
        "job_description": "Нужно сделать чат бота,  с отправкой ссылки и записи в текстовик, так же для скачивания этого текстовика. Но прежде, ссылка должна пройти модерацию, имеется готовый вариант бота, его нужно переделать/доделать."
    },
    "5003066": {
        "job_href": "https://www.fl.ru/projects/5003066/sborka-telegram-klienta-pod-android-ios-i-windows-.html",
        "job_title": "Сборка Телеграм клиента под Android, IOS и Windows ",
        "job_description": "Android 1. Убрат пункт завершение сеанса 2. Убрать мультиаккаунт 3. Убрат скан QR кода для входа через web 4. Настроить рабочую среду для разработчиков компании и передачи кода  IOS 1. Убрат пункт завершение сеанса 2. Убрать мультиаккаунт 3. Убрат скан QR кода для входа через web 4. Настроить рабочую среду для разработчиков компании и передачи кода  Desktop для сотрудников 1. Убрат пункт завершение сеанса 2. Убрать мультиаккаунт  3. Убрат скан QR кода для входа через web  Desktop для админа 1. Мультиаккаунт до 30 аккаунтов 2. Мониторинг вход с чужого версии телеграмма 3. Настроить рабочую среду для разработчиков компании и передачи кода"
    },
    "5003051": {
        "job_href": "https://www.fl.ru/projects/5003051/verstka-mob-prilojeniya-react-native--kitty-ui.html",
        "job_title": "Верстка моб приложения React native + kitty ui",
        "job_description": "Верстка моб приложения React native + kitty ui"
    },
    "5003050": {
        "job_href": "https://www.fl.ru/projects/5003050/dorabotka-po-kontrolleryi-beckhoff-scada-indosoft-webstudio.html",
        "job_title": "Доработка ПО Контроллеры Beckhoff, SCADA Indosoft WebStudio",
        "job_description": "Отображение таймера выполнения операции и его корректного отображения на SCADA, так же преобразование отображение массы из брутто в нетто с возможностью корректировки тары."
    },
    "5003043": {
        "job_href": "https://www.fl.ru/projects/5003043/php-parser-na-selenium.html",
        "job_title": "PHP-парсер на Selenium",
        "job_description": "Ищу программиста для написания парсера Ajax-сайтов на Selenium. Также приветствуется опыт настройки серверов (Linux).  Язык разработки: PHP (никаких питонов и прочего).  Пишите о вашем опыты, пообщаемся."
    },
    "5003040": {
        "job_href": "https://www.fl.ru/projects/5003040/raschetnaya-tablitsa-v-eksel.html",
        "job_title": "Расчетная таблица в Эксель",
        "job_description": "Нужно сделать таблицу в Эксель, привязка одних листов к другим, прописать формулы, чтобы считались сводные таблицы, расчетно-калькуляционные материалы по государственному оборонному заказу. Часть данных я ввожу, остальное высчитывает программа и делает свод по деталям и по производству в общем. Будет привязка к зарплате, налогам, календарным/рабочим дням, табелям, всем расходам по производству, разделенным на общие и по конкретным деталям. Ищу человека, который будет доделывать под меня, пока не получим конечный результат, который готов вникнуть в суть этих таблиц, и подскажет как удобно систематизировать. Все крупные компании ведут в 1С ERP, кто-то покупает ломанные версии 1С ПРОФ, для меня это не вариант, нужен именно Эксель."
    },
    "5003027": {
        "job_href": "https://www.fl.ru/projects/5003027/nujno-pomosch-razobratsya-s-django-channels.html",
        "job_title": "Нужно помощь разобраться с django channels",
        "job_description": "Всем привет, разбираюсь с джанго, чат сделать получилось, а с оповещениями пока не выходит. Ищу того, кто сможет объяснить, что такое layers, groups, send/group_send, workers, как отправить оповещение только нужному пользователю, независимо от того, на какой он странице, как сделать так, чтобы триггером отправки стало появление новой записи в базе.   Есть еще несколько вопросов по базам данных, джанго темплейтс, деплою, гиту.  Желательно сегодня днем или завтра в первой половине дня по МСК  За час предлагаю 1200р."
    },
    "5003030": {
        "job_href": "https://www.fl.ru/projects/5003030/razrabotat-servis-oblachnogo-geyminga.html",
        "job_title": "Разработать сервис облачного гейминга",
        "job_description": "Необходимо запустить сервис облачного гейминга, но с играми собственного производства. Пример того как это должно работать: gfn.ru/ Разрабатывать клиентское приложение не нужно, работать сервис должен только через браузер. Можно использовать готовые или полуготовые решения. Главное должна быть низкая задержка и высокое качество изображения."
    },
    "5003016": {
        "job_href": "https://www.fl.ru/projects/5003016/integratsionnoe-testirovanie-json-data.html",
        "job_title": "Интеграционное тестирование JSON data",
        "job_description": "Мы ищем эксперта, который знает codeception и webception и может создать серию интеграционных тестов. Пожалуйста, ознакомьтесь с прикрепленным файлом с заданием и описанием приложений, прикрепленных к этой задаче.  Мы ожидаем, что вы сделаете следующее:  Настройка:  - Создайте контейнер с установленными codeception и webception - Используйте тест записи PHP и модуль S3 в коде для подключения хранилища. - Подключиться к корзине S3 (будут предоставлены ключи API) и скачать файл payload.json (INPUT FILE) - Отправьте файл payload.json в наш микросервис, который выполняет математические операции (PROCESSOR) - Подключен к папке S3 (ключи API и подробная информация будут предоставлены), где хранятся результаты (OUTPUT FILES)  Анализ (с использованием OUTPUT FILES):  - Тест 1: возьмите timesheets.json (приложение 1) и сравните эту сумму всех полей длительности, равную сумме в ContractPnL.json (приложение 2). - Тест 2: Возьмите Contracts.json (Приложение 3) и сравните общее количество полей ContractName с количеством ContractPnL.json (Приложение 2)  Подавать результаты (webception)  - Подключить webception - Отображение результатов в webception  Результат должен включать Dockerfile и простой Readme, как использовать приложение.  Н./Б.: Мы рассчитываем, что будем работать с кем-то, кто хорошо разбирается в PHP и может хорошо использовать язык для выполнения математических вычислений. Мы не будем использовать какой-либо другой язык."
    },
    "5003025": {
        "job_href": "https://www.fl.ru/projects/5003025/sayt-dlya-dobavleniya-zagrujennogo-fayla-polzovatelem-v-neobhodimuyu-papku-na-lokalnom-kompyutere.html",
        "job_title": "Сайт для добавления загруженного файла пользователем в необходимую папку на локальном компьютере",
        "job_description": "Требуется программист, который сможет написать сайт, который работает по следующему алгоритму  1)авторизация 2)выбор точки на карте 3)выбор файла с устройства пользователя 4)интернет-оплата в зависимости от свойств файла 5)добавление полученного файла от пользователя в папку на компьютере подключенного к серверу по VPN (т.е. находящегося в одной локальной сети) 6)ожидание удаления файл в папку в которую положили 7)выдача оповещения, что операция завершена"
    },
    "5003019": {
        "job_href": "https://www.fl.ru/projects/5003019/dorabotka-crm-sistemyi-php-yii2.html",
        "job_title": "Доработка CRM системы PHP, Yii2",
        "job_description": "Ищем опытного разработчика или небольшую студию, которые за адекватный бюджет смогут дорабатывать нашу CRM систему. Рассматриваем долгосрочное сотрудничество. Есть большой описанный пул задач, проект в github. Оплата сдельная, по выполненным задачам. PHP+Yii2 Подробности в личном общении."
    },
    "5003007": {
        "job_href": "https://www.fl.ru/projects/5003007/smena-otvetstvennogo-za-svyazannyie-so-sdelkoy-zadachi-dela-kompanii-kontaktyi-v-bitriks24.html",
        "job_title": "Смена ответственного за связанные со Сделкой задачи, дела, компании, контакты в Битрикс24",
        "job_description": "Необходимо реализовать механизм смены ответственного за связанные со сделкой дела и задачи при изменении ответственного в сделке, при создании и изменении в контакте и компании. В отклике укажите сроки реализации и стоимость."
    },
    "5002994": {
        "job_href": "https://www.fl.ru/projects/5002994/svyazat-po-api-dve-crm-sistemyi-.html",
        "job_title": "Связать по API две CRM-системы ",
        "job_description": "Необходимо чтобы данные заказа (имя номер емейл клиента) и обновления статусов заказа (пришел / не пришел / отменил) передавались из сервиса Bukza в сервис Пачка по АПИ: bukza.ru/questions/first-...  crm.pachca.com/dev/gettin..."
    },
    "5002990": {
        "job_href": "https://www.fl.ru/projects/5002990/razrabotchik-mobilnogo-prilojeniya-i-telemetrii-dlya-vendinga.html",
        "job_title": "Разработчик мобильного приложения и телеметрии для вендинга",
        "job_description": "Современная и динамичная компания \"ФитВенд\" специализируется на размещении и обслуживании вендинговых протеиновых аппаратов по приготовлению спортивных коктейлей в крупных сетевых фитнесс центрах, спорт клубах Москвы, МО, Санкт-Петербурга и ЛО.Мы ищем исполнителя для разработки приложения и создания телеметрии вендинга.Приложение создается для ведения программ скидок и лояльности потребителей"
    },
    "5002975": {
        "job_href": "https://www.fl.ru/projects/5002975/seo-optimizatsiya-sayta.html",
        "job_title": "Seo оптимизация сайта",
        "job_description": "•\tПростановка тегов atl и title к изображениям (превью + карточка товара) •\tПропись новых шаблонных мета тегов (категории и товары) •\tНастройка каноникла   Система управления Drupal"
    },
    "5002973": {
        "job_href": "https://www.fl.ru/projects/5002973/nastroyka-smpp-soedinnnyie-s-mobilnyim-operatorom.html",
        "job_title": "Настройка SMPP Соединённые с мобильным оператором",
        "job_description": "Необходимо настроить SMPP Соединённые с мобильным оператором и протестировать отправку смс сообщений через него."
    },
    "5003154": {
        "job_href": "https://www.fl.ru/projects/5003154/optimizatsiya-sayta-dlya-seo.html",
        "job_title": "Оптимизация сайта для SEO",
        "job_description": "В рамках данного ТЗ мы решаем следующие задачи: (1) Приводим файловую архитектуру сайта к порядку. (2) Вычищаем мусор в коде. (3) Упрощаем код сайта так, чтобы блоки создавались единым методов в одном месте сайта, а данные тянулись из БД.&nbsp; Детали – в переписке"
    },
    "5003149": {
        "job_href": "https://www.fl.ru/projects/5003149/nastroit-kassu-na-sayte.html",
        "job_title": "Настроить кассу на сайте",
        "job_description": "На сайте (Joomla) установлена my-kassa.com, нужно ее настроить, чтобы была возможность оплачивать через нее. Сколько будет стоить?"
    },
    "5003145": {
        "job_href": "https://www.fl.ru/projects/5003145/crm-dlya-stomatrlogii-na-.html",
        "job_title": "Crm для стоматрлогии на ",
        "job_description": "Сделать crm для стоматологии с возможностью записи пациентов, ведения документации, хранения файлов.  Необходима возмодность использования с мобилтного телефона через браузер или приложение.  Есть аналог программы, могу прислать для ознакомления"
    },
    "5003143": {
        "job_href": "https://www.fl.ru/projects/5003143/zapusk-telegramm-bota-na-vps-.html",
        "job_title": "Запуск телеграмм бота на vps ",
        "job_description": "Нужно запустить на удаленный сервер телеграм бота, django"
    },
    "5003187": {
        "job_href": "https://www.fl.ru/projects/5003187/rassyilka-v-telegram.html",
        "job_title": "Рассылка в телеграм",
        "job_description": "Нужно сделать рассылку в телеграм в личку на 1000 человек. Скорее всего это будет фото с аудиосообщением.  Ниша – веб- и диджитал-дизайн. Хотелось бы это сделать до 19.06.  При выборе специалиста обращаю внимание также на умение общаться с людьми."
    },
    "5003184": {
        "job_href": "https://www.fl.ru/projects/5003184/postroenie-modeley-katushek-s-serdechnikom-v-comsol-multiphysics.html",
        "job_title": "Построение моделей катушек с сердечником в COMSOL Multiphysics",
        "job_description": "Необходимо построить 3 модели (графическое изображение прикрепляю) 1) катушка без сердечника  2) катушка с сердечником плоским и срезанным конусом с разным радиусом закругления (как параметр)  Задача – нахождение напряженности магнитного поля по оси симметрии катушек и сердечников (вдоль центральной оси), от 0 (на поверхности сердечника) до точки где напряженность нулевая, в зависимости от тока и числа витков, материала и формы сердечника.  3) две катушки, соединенные в одну эл. цепь, но каждая со своим сердечником разной формы (см. выше).  Расстояние между противоположными сердечниками фиксированное (как параметр), от 0,5 до 5 см. Задача – нахождение напряженности магнитного поля по оси симметрии катушек и сердечников (вдоль центральной оси) в точке ровно посередине между полюсами электромагнита в зависимости от формы сердечника из пермендюра. Тока у вас задан 15 А, остальные параметры тоже заданы, число витков порядка N=900 в каждой катушке.  Должна получиться рабочие модели, в которой можно задавать различные параметры и оценивать изменения характеристик электромагнита То есть зазор между полюсами меняет напряженность магнитного поля в точке О. То есть нужно построить зависимость​ напр. магнитного поля Н в точке О от расстояния между​ полюсами l.   Заданные параметры для моделирования электромагнита: • постоянный ток до 15 А; • сечение медного провода катушки 2,4 мм2; • размер катушки, ограниченный размерами панциря электромагнита (внешний диаметр 150 мм, высота 65 мм, внутренний диаметр 40 мм); • материал сердечника – пермендюр; • размер сердечника (длина 65 мм, внешний диаметр сердечника – 40 мм)  По поводу витков: Исходя из габаритов корпуса электромагнита, количество витков в сечении катушки для провода сечением 2,4 мм2 получается примерно 1500. Однако реально из-за сложности намотки количество витков не превышает 1000. Число витков порядка N=900 в каждой катушке.  В п.3 последовательное подключение. 2 катушки подключены в одну эл. цепь. Расстояние между противоположными сердечниками фиксированное ( как параметр), от 0,5 до 5 см.  На рисунке показано наглядно где располагаются точки, в которых мы ищем напряженность магнитного поля   Для расчета берём только пермендюр. Это магнито-мягкий материал, а мы работаем с максимальными полями, значит считаем что пермендюр находится по кривой намагничивания в состоянии насыщения с максимальной Ms  Число витков катушек везде одинаковые, величина тока тоже"
    },
    "5003183": {
        "job_href": "https://www.fl.ru/projects/5003183/1s-uat-mobilnaya-versiya-dorabotka-po-tz.html",
        "job_title": "1С УАТ (+мобильная версия) доработка по ТЗ",
        "job_description": "Добрый день! Срочно ищу программиста 1С УАТ, в приложении ТЗ. В откликах указывайте время исполнения и стоимость. Если по итогам работы обе стороны все устроит, на будущее готов обеспечить большим количеством заказов."
    },
    "5003168": {
        "job_href": "https://www.fl.ru/projects/5003168/dorabotki-na-yii2.html",
        "job_title": "Доработки на Yii2",
        "job_description": "Необходимы доработки сервиса на yii2. Разработка дополнительного функционала. По техническому заданию"
    },
    "5003166": {
        "job_href": "https://www.fl.ru/projects/5003166/razrabotat-programmu-ili-shemu-imitatsii-onlayn-trekinga-dlya-rnis.html",
        "job_title": "Разработать программу или схему имитации онлайн трекинга для РНИС",
        "job_description": "Необходимо для системы РНИС rnis.mos.ru/ разработать или найти способ: создания виртуального трекера для каждого транспортного средства запрограммировать его на движение по заданным маршрутам по заданному графику  Задача: Нашим транспортным средствам присвоить виртуальные трекеры, которые будут предавать телематические данные в систему РНИС имитирую заложенные в программу маршруты движения по заданному графику."
    },
    "5003161": {
        "job_href": "https://www.fl.ru/projects/5003161/chat-bot.html",
        "job_title": "чат бот",
        "job_description": "Нужен виджет для сайта собирающий номера телефоны с помощью элементарного бота . виджет должен звонить если клиент оставляет номе телефона ( пример dez-first.ru). Должна быть интеграция с АМО и комеджик что бы предавались в них данные."
    },
    "5000207": {
        "job_href": "https://www.fl.ru/projects/5000207/razrabotchik-na-unity-.html",
        "job_title": "Разработчик на Unity ",
        "job_description": "Ищу в свою команду разработчика на Unity. Наша команда состоит из 15 человек, в нее входит: аниматоры, художники, геймдизайнеры, дизайнеры, разработчики. Наше направление это мобильные игры для разных сторов, основные жанры: казуальные и гиперказуальные игры. Нужен человек с опытом разработки проектов в 2D и 3D. Преимуществом будет знание ECS."
    },
    "5003192": {
        "job_href": "https://www.fl.ru/projects/5003192/dobavit-podderjku-setevyih-slujb-k-wifi_gsm-routeru-podu-upravleniem-openwrt.html",
        "job_title": "Добавить поддержку сетевых служб к WiFi/GSM-роутеру поду управлением OpenWrt",
        "job_description": "Добавить поддержку сетевых служб к WiFi/GSM-роутеру поду управлением OpenWrt, включая веб-интерфейсы пользователя LuCI. Список сетевых служб:      SFTP / SSH доступ     VPN support     DMVPN support     DynDNS support     EoIP support (in OpenWrt 21.02 only)     IPSec support     L2TPv2/v3 support     NHRP support     PPTP support     Туннели GRE     Port Forwarding     DHCP support     Firewall support"
    },
    "5003198": {
        "job_href": "https://www.fl.ru/projects/5003198/parsing-wizemartru.html",
        "job_title": "Парсинг wizemart.ru",
        "job_description": "Необходимо спарсить данные с сайта wizemart.ru: 1. Фото товара (disk.yandex.com/i/JPctStx... 2. Характеристики товара (disk.yandex.com/i/CbGf9od... 3. Отзывы товара (disk.yandex.com/i/xDnxD1V...  Итог работы – бд с данными парсинга (+картинки)"
    },
    "5003199": {
        "job_href": "https://www.fl.ru/projects/5003199/nujen-programmist-na-umi-dlya-nebolshoy-korrektirovki-otobrajeniya-portfolio.html",
        "job_title": "Нужен программист на UMI, для небольшой корректировки отображения портфолио.",
        "job_description": "Нужно скорректировать порядок отображения объектов  в портфолио+ отображение картинок в самих объектах."
    },
    "5003203": {
        "job_href": "https://www.fl.ru/projects/5003203/perenesti-sayt-na-wp-s-sozdaniem-funktsionala.html",
        "job_title": "Перенести сайт на WP с созданием функционала",
        "job_description": "Сейчас есть сайт, восстановленный из архива. Т.е. все его страницы – это голый hlml Нужно перенести сайт с созданием функционала на WP Сайт – tlgrn.ru/"
    },
    "4989595": {
        "job_href": "https://www.fl.ru/projects/4989595/programmist-razrabotchik-hdl-verilog-fpga-plis.html",
        "job_title": "Программист-разработчик HDL (Verilog) FPGA (ПЛИС)",
        "job_description": "Программирование ПЛИС на языке HDL(Verilog), разработка, создание и сопровождение программных продуктов для ПЛИС Altera, Xilinx и Maxim Integrated в средах Quartus, ISE, IAR Embedded Workbench, MAX-IDE, CrossWorks.Не обязательно уметь все сразу, можно уметь что-то одно, остальное освоить в процессе работы, но что-то одно уметь нужно сразу (в том числе знать и уметь программировать на Verilog сразу, а также иметь опыт разработки на базе FPGA/ПЛИС в принципе).Задач есть несколько на текущий момент, подробнее расскажем уже заинтересованным и подходящим кандидатам. По сути работа сдельная, но постоянная на определенный бюджет в месяц (+/-)."
    },
    "5002735": {
        "job_href": "https://www.fl.ru/projects/5002735/parsing-dannyih-iz-prilojeniya-.html",
        "job_title": "Парсинг данных из приложения ",
        "job_description": "Нужно сделать парсинг данных из приложения «объявления» в вк. Необходимо получать номер телефона по id товара. Желательно, устроить работу через API (json), куда будет отправляться id товара, а в ответ получать номер телефона.  Всё должно работать в Docker (docker-compose) на Ubuntu.  МОШЕННИКИ – МИМО (не тратьте своё и моё время), ТОЛЬКО БЕЗОПСНАЯ СДЕЛКА."
    },
    "5003231": {
        "job_href": "https://www.fl.ru/projects/5003231/nastroyka-amocrm.html",
        "job_title": "Настройка amocrm",
        "job_description": "Настроить с нуля amocrm"
    },
    "5003232": {
        "job_href": "https://www.fl.ru/projects/5003232/napisat-soft-parser-na-python.html",
        "job_title": "Написать софт парсер на python",
        "job_description": "Написать парсер с выгрузкой отчета по транзакциям с крипто кошельков на python Вам будет дан файл (гугл табл с кошельками) из которого нужно брать инфу в работе задействуем сканеры: dogechain, etherscan, cardanoscan, bscscan, blockchair, litecoinblockexplorer.net, tronscan.org -криптовалюты должны быть все из коинмаркеткэп (определяться сами, автоматически) Также понадобится прокси, или как то решить эту проблему (т к прокси максимум на год, и их вручную добавлять не вариант) важные моменты: -софт должен выгружать отчет автоматически раз в неделю по расписанию (через крон на сервере) - кошельки по которым нужно парсить данные обновляются в течение недели (файл на гугл доке) - софт должен сохранять выгрузку прошлую (прошлый отчет) и дополнять новые транзакции за прошедшую неделю. т к если делать с нуля то количество запросов зашкаливает – это уже платный доступ, да и в целом долго. - отчет должен выгружаться в формате икселя (если получится то гугл таблицы) и сразу просчитывать все формулы Это сокращенное ТЗ, при отклике отправлю полное и отвечу на все вопросы От вас жду, примерную цену и сроки, кейсы по питону (желательно парсеров)"
    },
    "5003240": {
        "job_href": "https://www.fl.ru/projects/5003240/dorabotki-po-opencart-3.html",
        "job_title": "Доработки по Opencart #3",
        "job_description": "ТЗ видео 6 мин disk.yandex.kz/i/jxvg-2Ii..., видео лучше смотреть 1,5х 1. В характеристиках нужно сделать чтобы могли добавить категории, и при добавлении товара чтоб они выходили автоматом те характеристики которые относится к этой категории 2. В фильтрах (OCfilter) и в характеристиках сделать возможность поле обязательным (по умолчанию пусть стоит необязательными) 3. В характеристике сделать возможность делать основным (по умолчанию пусть стоит не основными) 4. В характеристиках сделать фильтр по категориям и по группам 5. При добавлении товара поле «HTML-тег H1» чтоб дублировал поле «Название товара», сделать его read only 6. Поля: Мета-тег title и Мета-тег Description сделать read only 7. Сделать обязательным и рядом поставить звезду красную указывающую что это обязательное поле, поля: Название товара, Мета-тег Keywords, Производитель, Категории, Изображение 8. Перенести все доработки на основной сайт"
    },
    "5003244": {
        "job_href": "https://www.fl.ru/projects/5003244/sostavit-4-modeli--idef0-kontseptualnaya-logicheskaya-fizicheskaya--po-dannyim-iz-diplomnogo-proekta.html",
        "job_title": "Составить 4 модели ( IDEF0, концептуальная, логическая, физическая ) по данным из дипломного проекта",
        "job_description": "Добрый вечер, препод сказал СЕГОДНЯ нужно сделать 4 модели 1) IDEF0  2) концептуальная 3) логическая 4) физическая  Данные для логической/физической предоставлю из диплома, там есть инфа о БД.  Данные по работе приложения тоже могу скинуть  Тема: АРМ администратора гостиницы и фитнес центра. (если это поможет)"
    }
}